{
  "examples": [
    {
      "link": "http://www.jasonrahm.net/budget-app.html",
      "anchor": "Personal Budget Application",
      "explanation": "I'm creating a Personal Budget Application using AngularJS, CSS, JavaScript and HTML. All of the free budget applications that I've found online are based on spreadsheets, and I hate using spreadsheets. So, I'm building my own. Currently, you're only able to add, edit, delete and print budget information. There is no backend support or user states; that's further down the road. I'm going to keep developing this application, so stay tuned."
    },
    {
      "link": "http://nursing.ucdenver.edu",
      "anchor": "University of Colorado College of Nursing",
      "explanation": "Since December, 2016, I have been the webmaster and front-end developer for the CU College of Nursing. My duties include administering both the public-facing website and internal intranet, updating content for each site and exploring ways to improve SEO and usability for both sites. Additionally, I am in the process of doing a major overhaul on the main website in anticipation of a transition off of the SharePoint 2010 CMS to Sitefinity."
    },
    {
      "link": "http://coleman.com/coleman-checklists.html",
      "anchor": "Coleman Checklists",
      "explanation": "This page was redesigned to provide all of the available checklists in one place. Originally, the user had to navigate several pages and a sign-in form to access a single checklist, and they had to sign in for each checklist. Now, a single click will load the checklist in the iframe space indicated; the images, links, content and iframes are loaded dynamically with JavaScript. Third-party cookies are required to view the checklists in the iframe, so a check is included to verify that the user has third-party cookies enabled."
    },
    {
      "link": "http://coleman.com/hyperflame-technology.html",
      "anchor": "Coleman Technology",
      "explanation": "My last project at Coleman was to create several pages to highlight the various technologies the company had invented. I was given a free hand with the design and layout. The content came from the various catalogs and images were found in the database. I’m pleased with the resulting “tech center”. However, I was limited to inline JavaScript and styling, so there are no shared components between the pages (the left nav should be a common component). I hope, in the future, they are able to turn this into a template-driven section of the site."
    }    
  ]
}